# Install pandas

In [1]:
import pandas as pd

### Read csv file

In [3]:
data = pd.read_csv('police.csv')

In [4]:
data.head()

,stop_date,stop_time,county_name,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,02-01-2005,01:55,NaN,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,18-01-2005,08:15,NaN,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,23-01-2005,23:15,NaN,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
3,20-02-2005,17:15,NaN,M,1986.0,19.0,White,Call for Service,Other,False,NaN,Arrest Driver,True,16-30 Min,False
4,14-03-2005,10:00,NaN,F,1984.0,21.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

In [7]:
data.shape

(91741, 15)

In [10]:
data.dtypes

stop_date              object
stop_time              object
county_name           float64
driver_gender          object
driver_age_raw        float64
driver_age            float64
driver_race            object
violation_raw          object
violation              object
search_conducted         bool
search_type            object
stop_outcome           object
is_arrested            object
stop_duration          object
drugs_related_stop       bool
dtype: object

In [62]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 91741 entries, 0 to 91740
Data columns (total 15 columns):
stop_date             91741 non-null object
stop_time             91741 non-null object
county_name           0 non-null float64
driver_gender         86406 non-null object
driver_age_raw        86414 non-null float64
driver_age            86120 non-null float64
driver_race           86408 non-null object
violation_raw         86408 non-null object
violation             86408 non-null object
search_conducted      91741 non-null bool
search_type           3196 non-null object
stop_outcome          86408 non-null object
is_arrested           86408 non-null object
stop_duration         86408 non-null object
drugs_related_stop    91741 non-null bool
dtypes: bool(2), float64(3), object(10)
memory usage: 9.3+ MB

### checking null values in each column

In [12]:
data.isnull().sum()

stop_date                 0
stop_time                 0
county_name           91741
driver_gender          5335
driver_age_raw         5327
driver_age             5621
driver_race            5333
violation_raw          5333
violation              5333
search_conducted          0
search_type           88545
stop_outcome           5333
is_arrested            5333
stop_duration          5333
drugs_related_stop        0
dtype: int64

### deleting whole column with drop method

In [15]:
data.drop('county_name', axis = 'columns',inplace = True)

In [16]:
data.head()

,stop_date,stop_time,driver_gender,driver_age_raw,driver_age,driver_race,violation_raw,violation,search_conducted,search_type,stop_outcome,is_arrested,stop_duration,drugs_related_stop
0,02-01-2005,01:55,M,1985.0,20.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
1,18-01-2005,08:15,M,1965.0,40.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
2,23-01-2005,23:15,M,1972.0,33.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False
3,20-02-2005,17:15,M,1986.0,19.0,White,Call for Service,Other,False,NaN,Arrest Driver,True,16-30 Min,False
4,14-03-2005,10:00,F,1984.0,21.0,White,Speeding,Speeding,False,NaN,Citation,False,0-15 Min,False

### lets take another example

In [17]:
ufo = pd.read_csv('ufo.csv')

In [18]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [19]:
ufo.shape

(18241, 5)

In [20]:
ufo.isnull().sum()

City                  25
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

### reading a panda series

In [21]:
ufo['Time']

0          6/1/1930 22:00
1         6/30/1930 20:00
2         2/15/1931 14:00
3          6/1/1931 13:00
4         4/18/1933 19:00
5         9/15/1934 15:30
6          6/15/1935 0:00
7          7/15/1936 0:00
8        10/15/1936 17:00
9          6/15/1937 0:00
10        8/15/1937 21:00
11         6/1/1939 20:00
12        6/30/1939 20:00
13          7/7/1939 2:00
14         6/1/1941 13:00
15         7/2/1941 11:30
16         2/25/1942 0:00
17         6/1/1942 22:30
18         7/15/1942 1:00
19        4/30/1943 23:00
20         6/1/1943 15:00
21         8/15/1943 0:00
22         8/15/1943 0:00
23       10/15/1943 11:00
24         1/1/1944 10:00
25         1/1/1944 12:00
26         1/1/1944 12:00
27         4/2/1944 11:00
28         6/1/1944 12:00
29        6/30/1944 10:00
               ...
18211    12/28/2000 18:00
18212    12/28/2000 18:20
18213    12/28/2000 19:10
18214     12/29/2000 0:00
18215     12/29/2000 9:00
18216    12/29/2000 16:10
18217    12/29/2000 19:30
18218    12/29/2000 20:00
18219    12/29/2000 20:30
18220    12/29/2000 20:30
18221    12/29/2000 20:50
18222    12/29/2000 21:00
18223    12/29/2000 22:00
18224    12/29/2000 23:30
18225    12/30/2000 10:00
18226    12/30/2000 22:00
18227    12/30/2000 22:00
18228     12/31/2000 4:00
18229    12/31/2000 11:45
18230    12/31/2000 20:00
18231    12/31/2000 20:00
18232    12/31/2000 20:30
18233    12/31/2000 21:00
18234    12/31/2000 22:00
18235    12/31/2000 23:00
18236    12/31/2000 23:00
18237    12/31/2000 23:00
18238    12/31/2000 23:45
18239    12/31/2000 23:45
18240    12/31/2000 23:59
Name: Time, Length: 18241, dtype: object

In [24]:
ufo.Colour Reported

SyntaxError: invalid syntax (<ipython-input-24-80816d7f9434>, line 1)

In [80]:
ufo['Colors Reported']

0           NaN
1           NaN
2           NaN
3           NaN
4           NaN
5           NaN
6           NaN
7           NaN
8           NaN
9           NaN
10          NaN
11          NaN
12          RED
13          NaN
14          NaN
15          NaN
16          NaN
17          NaN
18          NaN
19          RED
20          NaN
21          NaN
22          NaN
23          NaN
24          NaN
25          NaN
26          NaN
27          NaN
28          NaN
29          NaN
          ...
18211       NaN
18212       NaN
18213     GREEN
18214       NaN
18215       NaN
18216    ORANGE
18217       NaN
18218       NaN
18219       NaN
18220      BLUE
18221       NaN
18222       NaN
18223       NaN
18224       NaN
18225       NaN
18226       NaN
18227       NaN
18228       NaN
18229       NaN
18230       NaN
18231       NaN
18232       NaN
18233       RED
18234       NaN
18235       NaN
18236       NaN
18237       NaN
18238       NaN
18239       RED
18240       NaN
Name: Colors Reported, Length: 18241, dtype: object

In [26]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

### adding new column

In [29]:
ufo['Location'] = ufo.City +', ' + ufo.State
ufo['Location']

0                      Ithaca, NY
1                 Willingboro, NJ
2                     Holyoke, CO
3                     Abilene, KS
4        New York Worlds Fair, NY
5                 Valley City, ND
6                 Crater Lake, CA
7                        Alma, MI
8                     Eklutna, AK
9                     Hubbard, OR
10                    Fontana, CA
11                   Waterloo, AL
12                     Belton, SC
13                     Keokuk, IA
14                  Ludington, MI
15                Forest Home, CA
16                Los Angeles, CA
17                  Hapeville, GA
18                     Oneida, TN
19                 Bering Sea, AK
20                   Nebraska, NE
21                            NaN
22                            NaN
23                  Owensboro, KY
24                 Wilderness, WV
25                  San Diego, CA
26                 Wilderness, WV
27                     Clovis, NM
28                 Los Alamos, NM
29               Ft. Duschene, UT
                   ...
18211                 Holyoke, MA
18212                  Carson, CA
18213                Pasadena, CA
18214                  Austin, TX
18215                El Campo, TX
18216            Garden Grove, CA
18217           Berthoud Pass, CO
18218              Sisterdale, TX
18219            Garden Grove, CA
18220             Shasta Lake, CA
18221                Franklin, NH
18222          Albrightsville, PA
18223              Greenville, SC
18224                 Eufaula, OK
18225             Simi Valley, CA
18226           San Francisco, CA
18227           San Francisco, CA
18228              Kingsville, TX
18229                 Chicago, IL
18230             Pismo Beach, CA
18231             Pismo Beach, CA
18232                    Lodi, WI
18233               Anchorage, AK
18234                Capitola, CA
18235          Fountain Hills, AZ
18236              Grant Park, IL
18237             Spirit Lake, IA
18238             Eagle River, WI
18239             Eagle River, WI
18240                    Ybor, FL
Name: Location, Length: 18241, dtype: object

In [30]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [86]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time',
       'Location'],
      dtype='object')

### changing name of column

In [41]:
ufo.rename(columns = {'Colors Reported':'Colors_Reported', 'Shape Reported':'Shape_Reported'}, inplace = True)

In [42]:
ufo.columns

Index(['City', 'Colors_Reported', 'Shape_Reported', 'State', 'Time',
       'Location'],
      dtype='object')

In [43]:
ufo_cols = ['city', 'colors reported', 'shape reported', 'state', 'time', 'location']

In [44]:
ufo.columns = ufo_cols

In [45]:
ufo.head()

,city,colors reported,shape reported,state,time,location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

In [46]:
ufo.columns = ufo.columns.str.replace(' ', '_')

In [47]:
ufo.head()

,city,colors_reported,shape_reported,state,time,location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca, NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro, NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke, CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene, KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair, NY"

### handling missing values

In [110]:
ufo.isnull().sum()

city                  25
colors_reported    15359
shape_reported      2644
state                  0
time                   0
location              25
dtype: int64

In [113]:
#pd.Series([True, False, True, True, False]).sum()

3

In [118]:
ufo[ufo.city.isnull()]

      city colors_reported shape_reported state              time location
21     NaN             NaN            NaN    LA    8/15/1943 0:00      NaN
22     NaN             NaN          LIGHT    LA    8/15/1943 0:00      NaN
204    NaN             NaN           DISK    CA   7/15/1952 12:30      NaN
241    NaN            BLUE           DISK    MT    7/4/1953 14:00      NaN
613    NaN             NaN           DISK    NV    7/1/1960 12:00      NaN
1877   NaN          YELLOW         CIRCLE    AZ    8/15/1969 1:00      NaN
2013   NaN             NaN            NaN    NH     8/1/1970 9:30      NaN
2546   NaN             NaN       FIREBALL    OH  10/25/1973 23:30      NaN
3123   NaN             RED       TRIANGLE    WV  11/25/1975 23:00      NaN
4736   NaN             NaN         SPHERE    CA   6/23/1982 23:00      NaN
5269   NaN             NaN            NaN    AZ   6/30/1985 21:30      NaN
6735   NaN             NaN      FORMATION    TX     4/1/1992 2:00      NaN
7208   NaN             NaN         CIRCLE    MI   10/4/1993 17:30      NaN
8828   NaN             NaN       TRIANGLE    WA  10/30/1995 21:30      NaN
8967   NaN             NaN        VARIOUS    CA   12/8/1995 18:00      NaN
9273   NaN             NaN       TRIANGLE    OH     5/1/1996 3:00      NaN
9388   NaN             NaN           OVAL    CA   6/12/1996 12:00      NaN
9587   NaN             NaN            EGG    FL   8/24/1996 15:00      NaN
10399  NaN             NaN       TRIANGLE    IL   6/15/1997 23:00      NaN
11625  NaN             NaN         CIRCLE    TX     6/7/1998 7:00      NaN
12441  NaN             RED       FIREBALL    WA  10/26/1998 17:58      NaN
15767  NaN             NaN      RECTANGLE    NV   1/21/2000 11:30      NaN
15812  NaN             NaN          LIGHT    NV     2/2/2000 3:00      NaN
16054  NaN           GREEN            NaN    FL    3/11/2000 3:30      NaN
16608  NaN             NaN         SPHERE    NY   6/15/2000 15:00      NaN

In [119]:
ufo.dropna(how = 'any').shape

(2486, 6)

In [120]:
ufo.dropna(how = 'all').shape

(18241, 6)

In [123]:
ufo.dropna(subset = ['city', 'shape_reported'], how = 'any').shape

(15576, 6)

In [48]:
ufo.dropna(subset = ['city', 'shape_reported'], how = 'all').shape

(18237, 6)

In [53]:
ufo['shape_reported'].value_counts(dropna = False)

LIGHT        2803
NaN          2644
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
HEXAGON         1
PYRAMID         1
DOME            1
FLARE           1
Name: shape_reported, dtype: int64

In [135]:
ufo['shape_reported'].fillna(value = 'VARIOUS', inplace = True)

In [136]:
ufo['shape_reported'].value_counts(dropna = False)

LIGHT        2803
VAIOUS       2644
DISK         2122
TRIANGLE     1889
OTHER        1402
CIRCLE       1365
SPHERE       1054
FIREBALL     1039
OVAL          845
CIGAR         617
FORMATION     434
VARIOUS       333
RECTANGLE     303
CYLINDER      294
CHEVRON       248
DIAMOND       234
EGG           197
FLASH         188
TEARDROP      119
CONE           60
CROSS          36
DELTA           7
CRESCENT        2
ROUND           2
DOME            1
FLARE           1
HEXAGON         1
PYRAMID         1
Name: shape_reported, dtype: int64

## lets analys data with pandas

In [2]:
heart = pd.read_csv('heart.csv')

In [3]:
heart.head()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1

In [57]:
heart.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 14 columns):
age         303 non-null int64
sex         303 non-null int64
cp          303 non-null int64
trestbps    303 non-null int64
chol        303 non-null int64
fbs         303 non-null int64
restecg     303 non-null int64
thalach     303 non-null int64
exang       303 non-null int64
oldpeak     303 non-null float64
slope       303 non-null int64
ca          303 non-null int64
thal        303 non-null int64
target      303 non-null int64
dtypes: float64(1), int64(13)
memory usage: 33.2 KB

In [59]:
heart.shape

(303, 14)

In [60]:
heart.isnull().sum()

age         0
sex         0
cp          0
trestbps    0
chol        0
fbs         0
restecg     0
thalach     0
exang       0
oldpeak     0
slope       0
ca          0
thal        0
target      0
dtype: int64

In [141]:
heart["target"].describe()

count    303.000000
mean       0.544554
std        0.498835
min        0.000000
25%        0.000000
50%        1.000000
75%        1.000000
max        1.000000
Name: target, dtype: float64

In [142]:
heart["target"].unique()

array([1, 0], dtype=int64)

In [12]:
heart.corr()["target"].abs().sort_values(ascending=False)

target      1.000000
exang       0.436757
cp          0.433798
oldpeak     0.430696
thalach     0.421741
ca          0.391724
slope       0.345877
thal        0.344029
sex         0.280937
age         0.225439
trestbps    0.144931
restecg     0.137230
chol        0.085239
fbs         0.028046
Name: target, dtype: float64

## Merge CSV files

In [144]:
train= pd.read_csv('train.csv')
items= pd.read_csv('item_data.csv')
view_log= pd.read_csv('view_log.csv')

In [145]:
train.head()train.shape

,impression_id,impression_time,user_id,app_code,os_version,is_4G,is_click
0,c4ca4238a0b923820dcc509a6f75849b,2018-11-15 00:00:00,87862,422,old,0,0
1,45c48cce2e2d7fbdea1afc51c7c6ad26,2018-11-15 00:01:00,63410,467,latest,1,1
2,70efdf2ec9b086079795c442636b55fb,2018-11-15 00:02:00,71748,259,intermediate,1,0
3,8e296a067a37563370ded05f5a3bf3ec,2018-11-15 00:02:00,69209,244,latest,1,0
4,182be0c5cdcd5072bb1864cdee4d3d6e,2018-11-15 00:02:00,62873,473,latest,0,0

In [148]:
train.shape

(237609, 7)

In [149]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 237609 entries, 0 to 237608
Data columns (total 7 columns):
impression_id      237609 non-null object
impression_time    237609 non-null object
user_id            237609 non-null int64
app_code           237609 non-null int64
os_version         237609 non-null object
is_4G              237609 non-null int64
is_click           237609 non-null int64
dtypes: int64(4), object(3)
memory usage: 12.7+ MB

In [146]:
items.head()

   item_id  item_price  category_1  category_2  category_3  product_type
0    26880        4602          11          35          20          3040
1    54939        3513          12          57          85          6822
2    40383         825          17           8         279          1619
3     8777        2355          13          58         189          5264
4   113705        1267          17          39         151         10239

In [153]:
items.shape

(132761, 6)

In [154]:
items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 132761 entries, 0 to 132760
Data columns (total 6 columns):
item_id         132761 non-null int64
item_price      132761 non-null int64
category_1      132761 non-null int64
category_2      132761 non-null int64
category_3      132761 non-null int64
product_type    132761 non-null int64
dtypes: int64(6)
memory usage: 6.1 MB

In [147]:
view_log.head()

           server_time device_type  session_id  user_id  item_id
0  2018-10-15 08:58:00     android      112333     4557    32970
1  2018-10-15 08:58:00     android      503590    74788     7640
2  2018-10-15 08:58:00     android      573960    23628   128855
3  2018-10-15 08:58:00     android      121691     2430    12774
4  2018-10-15 08:58:00     android      218564    19227    28296

In [155]:
view_log.shape

(3118622, 5)

In [156]:
view_log.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3118622 entries, 0 to 3118621
Data columns (total 5 columns):
server_time    object
device_type    object
session_id     int64
user_id        int64
item_id        int64
dtypes: int64(3), object(2)
memory usage: 119.0+ MB

In [157]:
train["is_click"].unique()

array([0, 1], dtype=int64)

In [158]:
items_view_logs = pd.merge(items, view_log, on= 'item_id', how= 'left')

In [159]:
items_view_logs.head()

,item_id,item_price,category_1,category_2,category_3,product_type,server_time,device_type,session_id,user_id
0,26880,4602,11,35,20,3040,2018-10-24 15:22:00,android,884484.0,24873.0
1,26880,4602,11,35,20,3040,2018-10-24 15:30:00,android,884484.0,24873.0
2,54939,3513,12,57,85,6822,2018-10-19 09:31:00,android,417118.0,34832.0
3,54939,3513,12,57,85,6822,2018-10-21 03:08:00,android,408682.0,59619.0
4,54939,3513,12,57,85,6822,2018-10-21 13:31:00,android,934901.0,52345.0

In [161]:
items_view_logs.shape

(3122994, 10)

In [162]:
train= pd.merge(train, items_view_logs, on='user_id', how= 'left')

In [ ]:
train_new= pd.merge(train, items, on='user_id', how= 'left')

In [163]:
train.head()

,impression_id,impression_time,user_id,app_code,os_version,is_4G,is_click,item_id,item_price,category_1,category_2,category_3,product_type,server_time,device_type,session_id
0,c4ca4238a0b923820dcc509a6f75849b,2018-11-15 00:00:00,87862,422,old,0,0,43886.0,2350.0,11.0,35.0,20.0,5622.0,2018-10-19 18:11:00,android,190710.0
1,45c48cce2e2d7fbdea1afc51c7c6ad26,2018-11-15 00:01:00,63410,467,latest,1,1,109074.0,6330.0,10.0,63.0,295.0,9337.0,2018-12-10 19:48:00,android,135003.0
2,45c48cce2e2d7fbdea1afc51c7c6ad26,2018-11-15 00:01:00,63410,467,latest,1,1,109074.0,6330.0,10.0,63.0,295.0,9337.0,2018-12-10 19:59:00,android,135003.0
3,45c48cce2e2d7fbdea1afc51c7c6ad26,2018-11-15 00:01:00,63410,467,latest,1,1,71877.0,3961.0,10.0,63.0,295.0,2270.0,2018-10-24 11:14:00,android,15568.0
4,45c48cce2e2d7fbdea1afc51c7c6ad26,2018-11-15 00:01:00,63410,467,latest,1,1,22064.0,1024.0,11.0,76.0,67.0,8411.0,2018-12-10 20:03:00,android,135003.0

In [164]:
train.shape

(11046042, 16)

In [61]:
train['is_click'].unique()

NameError: name 'train' is not defined

In [166]:
train['is_click'].value_counts()

0    10384856
1      661186
Name: is_click, dtype: int64

In [ ]:
print(train.corr()["is_click"].abs().sort_values(ascending=False))